read_verilog sumador.v
hierarchy -check -top sumador
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean -purge
write_verilog synth_sumador.v