read_verilog SUSTITUIR.v
hierarchy -check -top SUSTITUIR
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean -purge
write_verilog synth_SUSTITUIR.v